tap "homebrew/bundle"

cask "font-d2coding"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk-jp"
cask "font-pretendard"

brew "act"
brew "actionlint"
brew "bat"
brew "bottom"
brew "caddy"
brew "chezmoi"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "hyperfine"
brew "imagemagick"
brew "just"
brew "lsd"
brew "mas"
brew "media-info"
brew "mkcert"
brew "neovim"
brew "pinentry-mac"
brew "python@3.12"
brew "pipx"
brew "rename"
brew "sheldon"
brew "shellcheck"
brew "tealdeer"
brew "typos-cli"
brew "unzip"
brew "yt-dlp"

cask "alacritty"
cask "anki"
cask "arc"
cask "bruno"
cask "cleanupbuddy"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "gureumkim"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "kitty"
cask "kobo"
cask "linearmouse"
cask "logseq"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "ogdesign-eagle"
cask "raycast"
cask "ridibooks"
cask "sigil"
cask "spotify"
cask "superproductivity"
cask "telegram-desktop"
cask "ticktick"
cask "transmission"
cask "tuta-mail"
cask "visual-studio-code"
cask "vlc"

tap "voicevox/voicevox"
cask "voicevox"

mas "Bitwarden", id: 1352778147
mas "Dictionaries", id: 1380563956
mas "KakaoTalk", id: 869223134
mas "Numbers", id: 409203825

vscode "alefragnani.project-manager"
vscode "alexkrechik.cucumberautocomplete"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.cssrem"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "ghmcadams.lintlens"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "htmlhint.vscode-htmlhint"
vscode "jacobcassidy.css-nesting-syntax-highlighting"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lea21st.vscode-sql-formatter"
vscode "leonardssh.vscord"
vscode "marp-team.marp-vscode"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "moalamri.inline-fold"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicoespeon.abracadabra"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "onlyutkarsh.vsix-viewer"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "pucelle.vscode-css-navigation"
vscode "rust-lang.rust-analyzer"
vscode "sclu1034.justfile"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tekumara.typos-vscode"
vscode "timonwong.shellcheck"
vscode "tobermory.es6-string-html"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vunguyentuan.vscode-postcss"
vscode "webben.browserslist"
vscode "wix.vscode-import-cost"
vscode "xadillax.viml"
vscode "yechunan.json-color-token"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
