tap "homebrew/bundle"

tap "homebrew/cask-fonts"
cask "font-d2coding"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-pretendard"

brew "act"
brew "bat"
brew "bottom"
brew "chezmoi"
brew "fd"
brew "fnm"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "hyperfine"
brew "lsd"
brew "mas"
brew "mkcert"
brew "neovim"
brew "pinentry-mac"
brew "python@3.12"
brew "sheldon"
brew "shellcheck"
brew "tealdeer"

cask "alacritty"
cask "arc"
cask "bitwarden"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "gureumkim"
cask "linearmouse"
cask "logseq"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "spotify"
cask "telegram-desktop"
cask "ticktick"
cask "tutanota"
cask "visual-studio-code"

cask "chromium", args: { no_quarantine: true }

mas "KakaoTalk", id: 869223134

vscode "alefragnani.project-manager"
vscode "alexkrechik.cucumberautocomplete"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.cssrem"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "ghmcadams.lintlens"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "HTMLHint.vscode-htmlhint"
vscode "JakeBecker.elixir-ls"
vscode "JannisX11.batch-rename-extension"
vscode "jock.svg"
vscode "JuanBlanco.solidity"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lea21st.vscode-sql-formatter"
vscode "LeonardSSH.vscord"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "moalamri.inline-fold"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicoespeon.abracadabra"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "onlyutkarsh.vsix-viewer"
vscode "phoenisx.cssvar"
vscode "PKief.material-icon-theme"
vscode "pucelle.vscode-css-navigation"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "Tobermory.es6-string-html"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vunguyentuan.vscode-postcss"
vscode "webben.browserslist"
vscode "wix.vscode-import-cost"
vscode "XadillaX.viml"
vscode "yechunan.json-color-token"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "ZixuanChen.vitest-explorer"
vscode "zjcompt.es6-string-javascript"
