alefragnani.project-manager
alexkrechik.cucumberautocomplete
astro-build.astro-vscode
asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
ChakrounAnas.turbo-console-log
christian-kohler.path-intellisense
cipchk.cssrem
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dotenv.dotenv-vscode
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.code-runner
foxundermoon.shell-format
ghmcadams.lintlens
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
Gruntfuggly.todo-tree
HTMLHint.vscode-htmlhint
JakeBecker.elixir-ls
JannisX11.batch-rename-extension
jock.svg
JuanBlanco.solidity
kisstkondoros.vscode-codemetrics
kisstkondoros.vscode-gutter-preview
lea21st.vscode-sql-formatter
LeonardSSH.vscord
marp-team.marp-vscode
mechatroner.rainbow-csv
meganrogge.template-string-converter
moalamri.inline-fold
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-playwright.playwright
ms-python.autopep8
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vscode.live-server
ms-vsliveshare.vsliveshare
nicoespeon.abracadabra
nrwl.angular-console
oderwat.indent-rainbow
onlyutkarsh.vsix-viewer
phoenisx.cssvar
PKief.material-icon-theme
pucelle.vscode-css-navigation
rust-lang.rust-analyzer
sandcastle.vscode-open
serayuzgur.crates
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
tauri-apps.tauri-vscode
timonwong.shellcheck
Tobermory.es6-string-html
Tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
valentjn.vscode-ltex
VisualStudioExptTeam.vscodeintellicode
vunguyentuan.vscode-postcss
WallabyJs.console-ninja
WallabyJs.quokka-vscode
wix.vscode-import-cost
XadillaX.viml
yechunan.json-color-token
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
ZixuanChen.vitest-explorer
zjcompt.es6-string-javascript
