alefragnani.project-manager
alexkrechik.cucumberautocomplete
asvetliakov.vscode-neovim
ChakrounAnas.turbo-console-log
christian-kohler.path-intellisense
cipchk.cssrem
clinyong.vscode-css-modules
codezombiech.gitignore
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dotenv.dotenv-vscode
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.code-runner
foxundermoon.shell-format
golang.go
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
Gruntfuggly.todo-tree
jock.svg
JuanBlanco.solidity
kisstkondoros.vscode-gutter-preview
lea21st.vscode-sql-formatter
LeonardSSH.vscord
mechatroner.rainbow-csv
meganrogge.template-string-converter
moalamri.inline-fold
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-playwright.playwright
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
PKief.material-icon-theme
ritwickdey.LiveServer
rust-lang.rust-analyzer
sandcastle.vscode-open
serayuzgur.crates
styled-components.vscode-styled-components
stylelint.vscode-stylelint
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
timonwong.shellcheck
Tobermory.es6-string-html
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime
wix.vscode-import-cost
XadillaX.viml
yechunan.json-color-token
yzhang.markdown-all-in-one
ZixuanChen.vitest-explorer
